#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//int main()
//{
//	int a = -2147483647;
//	//11111111111111111111111111111111
//	//10000000000000000000000000000000
//	//10000000000000000000000000000001
//
//	//10000000000000000000000000000001
//	//00000000000000000000000000000010
//	printf("%d", a << 1);
//	return 0;
//}

int main()//交换两数
{
	int a = 3;
	int b = 5;
	printf("a=%d,b=%d\n", a, b);
	
	//方法三
	a = a ^ b;
	b = a ^ b;
	a = a ^ b;

	//方法二
	a = a + b;
	b = a - b;
	a = a - b;
	
	//方法一
	int tmp = a;
	a = b;
	b = tmp;

	printf("a=%d,b=%d\n", a, b);
}